Documents/ESB/ESB_Consumer_1022/003TestSample/SAMPLE_XML_MUST/DebitCard/DC18_DbCardResndAppntAddRq.xml

<?xml version="1.0" encoding="utf-8"?>

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:v1="http://www.iisigroup.com/magiclamp/common/soapenv.xsd/v1" xmlns:v11="http://www.nextbank.com.tw/xsd/TW/DebitCard/DbCardResndAppntAddRq/v1">  
  <soap:Header> 
    <v1:Header v1:mustUnderstand="true"> 
      <ChannelID>ESB</ChannelID>  
      <ServiceDomain>DebitCard</ServiceDomain>  
      <OperationName>DbCardResndAppntAdd</OperationName>  
      <ConsumerID>TWESB</ConsumerID>  
      <TransactionID>T1222222</TransactionID>  
      <RqTimestamp>2015-12-06T12:01:01.00+08:00</RqTimestamp> 
    </v1:Header> 
  </soap:Header>  
  <soap:Body> 
    <v11:DbCardResndAppntAddRq> 
      <v11:ServiceHeader> 
        <v11:TxnId>DC18</v11:TxnId>  
        <v11:TxnNo>DC1800001</v11:TxnNo> 
      </v11:ServiceHeader>  
      <v11:Signon> 
        <v11:CustId>ESBUSER</v11:CustId> 
      </v11:Signon>  
      <v11:ServiceBody> 
        <v11:CardNo>4563020616112800</v11:CardNo>  
        <v11:ResndAppntType>1</v11:ResndAppntType>  
        <v11:ResndAppntCode>11</v11:ResndAppntCode>  
        <!--Optional:-->  
        <v11:ExpAppntRsnCode>01</v11:ExpAppntRsnCode>  
        <!--Optional:-->  
        <v11:ExpUpdtDate>20010101</v11:ExpUpdtDate>  
        <!--Optional:-->  
        <v11:ResndRsn>1</v11:ResndRsn>  
        <!--Optional:-->  
        <v11:ResndDate>20010101</v11:ResndDate> 
      </v11:ServiceBody> 
    </v11:DbCardResndAppntAddRq> 
  </soap:Body> 
</soap:Envelope>
